index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-10-23 Fri 14:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>moo 無 model oriented objects</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Brett Viren" />
<link rel="stylesheet" type="text/css" href="export/styles/darksun/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="export/styles/darksun/css/darksun.css"/>
<link rel="stylesheet" type="text/css" href="export/styles/darksun/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">moo 無 model oriented objects
<br />
<span class="subtitle">Model Oriented Objects</span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#overview">Overview</a></li>
<li><a href="#version">Version</a></li>
<li><a href="#install">Installation</a>
<ul>
<li><a href="#orgb7b2793">Install a release</a></li>
<li><a href="#orgce3be52">Install development</a></li>
</ul>
</li>
<li><a href="#punt">Quick start</a></li>
<li><a href="#docs">Documentation</a></li>
</ul>
</div>
</div>

<div id="outline-container-overview" class="outline-2">
<h2 id="overview">Overview</h2>
<div class="outline-text-2" id="text-overview">
<p>
<b>moo</b> is a tool for managing data structures.  <b>moo</b> operates on:
</p>

<dl class="org-dl">
<dt>schema</dt><dd>data structures describing the structure of data (including schema).</dd>

<dt>model</dt><dd>data structure matching schema to a template.</dd>

<dt>templates</dt><dd>marked up text in some target format which is parameterized by a model and from which a document (eg, C++ code file) may be generated.</dd>

<dt>codegen</dt><dd>generated artifacts</dd>
</dl>
</div>
</div>

<div id="outline-container-version" class="outline-2">
<h2 id="version">Version</h2>
<div class="outline-text-2" id="text-version">
<p>
The current <b>moo</b> version is
</p>

<div class="org-src-container">
<pre class="src src-shell">moo version
</pre>
</div>

<pre class="example">
0.1.x-dev
</pre>
</div>
</div>



<div id="outline-container-install" class="outline-2">
<h2 id="install">Installation</h2>
<div class="outline-text-2" id="text-install">
<p>
<b>moo</b> requires Python 3.5 or newer and <code>python</code> below is assumed to
provide that.
</p>

<p>
<b>moo</b> installs in to your favorite Python environment in most of the
usual ways.  Some examples are given below.  Due to a name conflict
(this) <b>moo</b> is not expected to be distributed through PyPI.
</p>
</div>

<div id="outline-container-orgb7b2793" class="outline-3">
<h3 id="orgb7b2793">Install a release</h3>
<div class="outline-text-3" id="text-orgb7b2793">
<pre class="example">
$ python -m pip install https://github.com/brettviren/moo/archive/0.1.0.tar.gz
</pre>
</div>
</div>

<div id="outline-container-orgce3be52" class="outline-3">
<h3 id="orgce3be52">Install development</h3>
<div class="outline-text-3" id="text-orgce3be52">
<p>
Just install:
</p>

<pre class="example">
$ python -m pip install git+git://github.com/brettviren/moo.git#egg=moo
</pre>

<p>
Or, to allow working on the code:
</p>

<pre class="example">
$ git clone https://github.com/brettviren/moo.git
$ cd moo
$ pyton -m pip install -e .
</pre>
</div>
</div>
</div>

<div id="outline-container-punt" class="outline-2">
<h2 id="punt">Quick start</h2>
<div class="outline-text-2" id="text-punt">
<p>
The <b>moo</b> command line interface provides various commands and online
help:
</p>

<pre class="example">
$ moo --help
</pre>

<p>
See documentation section for details.
</p>
</div>
</div>

<div id="outline-container-docs" class="outline-2">
<h2 id="docs">Documentation</h2>
<div class="outline-text-2" id="text-docs">
<ul class="org-ul">
<li><a href="https://brettviren.github.io/moo">https://brettviren.github.io/moo</a></li>

<li><a href="https://github.com/brettviren/moo">code repository</a> and its <a href="README.html">README</a></li>

<li><a href="moo.html">moo high level documentation</a></li>

<li><a href="oschema.html">moo object schema paradigm</a></li>

<li><a href="otypes.html">moo object types</a></li>

<li><a href="buildsys.html">moo and build systems</a></li>

<li><a href="wcup.html">moo as Wire-Cell user package generator</a></li>

<li><a href="reqs.html">moo for LaTeX and spreadsheet generator</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Brett Viren</p>
<p class="date">Created: 2020-10-23 Fri 14:21</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
